# Lower Case Column Names In Pandas Dataframe
### Preliminaries

In [1]:
# Import modules
import pandas as pd

# Set iPython'r max row display
pd.set_option('display.max_row', 1000)
pd.set_option('display.max_columns', 50)

### Create an example dataframe

In [2]:
# Create an example dataframe
data = {'NAME': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'YEAR': [2012, 2012, 2013, 2014, 2014], 
        'REPORTS': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             NAME  REPORTS  YEAR
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

### Lowercase column values

In [3]:
# Map the lowering function to all column names
df.columns = map(str.lower, df.columns)

In [4]:
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

Source: https://chrisalbon.com/python/pandas_lowercase_column_names.html